text = """Технології розвиваються стрімко. Кожен день ми спостерігаємо нові досягнення в науці та техніці. 
Комп'ютери стають все потужнішими, а програмне забезпечення – складнішим. Проте, разом з цими досягненнями 
зростає і потреба в нових спеціалістах, здатних працювати з сучасними технологіями."""

# - знаки пунктуаціі і ставимо маленькі букви
text = text.replace(".", "").replace(",", "").replace("–", "").lower()

# текст на окремі слова та залишаємо ті які не повсторюються
unique_words = set(text.split())

# результат
print("Кількість неповторних слів:", len(unique_words))
